#### SchemaCommon Members

---

|  |
| --- |
| SchemaCommon Class   Properties   See Also |

The  SchemaCommon  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | BaseSchema | The property labeled "BaseSchema" common to all visual Asset types. |
| Public property Static member | Category | The property labeled "Category" common to all visual Asset types. |
| Public property Static member | Description | The property labeled "Description" common to all visual Asset types. |
| Public property Static member | Hidden | The property labeled "Hidden" common to all visual Asset types. |
| Public property Static member | Keyword | The property labeled "Keyword" common to all visual Asset types. |
| Public property Static member | Thumbnail | The property labeled "Thumbnail" common to all visual Asset types. |
| Public property Static member | UIName | The property labeled "UIName" common to all visual Asset types. |
| Public property Static member | VersionGUID | The property labeled "VersionGUID" common to all visual Asset types. |

# See Also

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace